In [22]:
import pandas as pd

In [129]:
df9=pd.DataFrame({"a":[1,2,3],"b":[4,5,6],"c":[7,8,9]})

In [130]:
df9

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [25]:
l=[[7,8,9]]

In [26]:
df.set_index(l)

   a  b  c
7  1  4  7
8  2  5  8
9  3  6  9

In [27]:
df.reset_index()

   index  a  b  c
0      0  1  4  7
1      1  2  5  8
2      2  3  6  9

In [28]:
df1=df.reindex([3,4,5])

In [29]:
df1

    a   b   c
3 NaN NaN NaN
4 NaN NaN NaN
5 NaN NaN NaN

In [33]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [32]:
for i in df.iterrows():
    print( i)

(0, a    1
b    4
c    7
Name: 0, dtype: int64)
(1, a    2
b    5
c    8
Name: 1, dtype: int64)
(2, a    3
b    6
c    9
Name: 2, dtype: int64)

In [35]:
for i in df.iterrows():
    print(i)

(0, a    1
b    4
c    7
Name: 0, dtype: int64)
(1, a    2
b    5
c    8
Name: 1, dtype: int64)
(2, a    3
b    6
c    9
Name: 2, dtype: int64)

In [36]:
for i in df.iteritems():
    print(i)

('a', 0    1
1    2
2    3
Name: a, dtype: int64)
('b', 0    4
1    5
2    6
Name: b, dtype: int64)
('c', 0    7
1    8
2    9
Name: c, dtype: int64)

/tmp/ipykernel_84/36948316.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for i in df.iteritems():

In [37]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [131]:
df9['name']=["kabir","pradeep","suresh"]

In [135]:
df9

   a  b  c     name
0  1  4  7    kabir
1  2  5  8  pradeep
2  3  6  9   suresh

In [136]:
df9['surname']=['Gautam','Bhandari','Sigdel']

In [137]:
df9

   a  b  c     name   surname
0  1  4  7    kabir    Gautam
1  2  5  8  pradeep  Bhandari
2  3  6  9   suresh    Sigdel

In [44]:
df['surname'].dtypes

dtype('O')

In [45]:
df.dtypes

a           int64
b           int64
c           int64
name       object
surname    object
dtype: object

In [48]:
def test(x):
    return x.sum()

df.apply(test)

a                             6
b                            15
c                            24
name         kabirpradeepsuresh
surname    GautamBhandariSigdel
dtype: object

In [50]:
def multiply(x):
    return x**2
df['a'].apply(multiply)

0    1
1    4
2    9
Name: a, dtype: int64

In [49]:
df

   a  b  c     name   surname
0  1  4  7    kabir    Gautam
1  2  5  8  pradeep  Bhandari
2  3  6  9   suresh    Sigdel

In [52]:
def mulitply(x):
    return x**2
df['b'].apply(multiply)

0    16
1    25
2    36
Name: b, dtype: int64

In [57]:
df2=pd.DataFrame({'a':[1,2,3,4,5],'b':[5,6,7,8,9]})

In [58]:
df2

   a  b
0  1  5
1  2  6
2  3  7
3  4  8
4  5  9

In [63]:
df2.applymap(lambda x: x**2)

    a   b
0   1  25
1   4  36
2   9  49
3  16  64
4  25  81

In [64]:
df2.sort_values('b')

   a  b
0  1  5
1  2  6
2  3  7
3  4  8
4  5  9

In [65]:
df

   a  b  c     name   surname
0  1  4  7    kabir    Gautam
1  2  5  8  pradeep  Bhandari
2  3  6  9   suresh    Sigdel

In [66]:
df.sort_values('name')

   a  b  c     name   surname
0  1  4  7    kabir    Gautam
1  2  5  8  pradeep  Bhandari
2  3  6  9   suresh    Sigdel

In [77]:
df.sort_index(ascending=False)

   a  b  c     name   surname
2  3  6  9   suresh    Sigdel
1  2  5  8  pradeep  Bhandari
0  1  4  7    kabir    Gautam

In [78]:
df.set_index([[8,9,3]],inplace=True)

In [79]:
df.sort_index()

   a  b  c     name   surname
3  1  4  7    kabir    Gautam
8  3  6  9   suresh    Sigdel
9  2  5  8  pradeep  Bhandari

In [80]:
df.sort_index(ascending=False)

   a  b  c     name   surname
9  2  5  8  pradeep  Bhandari
8  3  6  9   suresh    Sigdel
3  1  4  7    kabir    Gautam

In [91]:
pd.set_option('display.max_colwidth',5000)
df3=pd.DataFrame({'Desc':['Germany hosts the tournament, which is taking place from 14 June 2024 to 14 July 2024. The tournament comprises 24 teams, with Georgia being the only team Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..']})

In [92]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               Desc
0  Germany hosts the tournament, which is taking place from 14 June 2024 to 14 July 2024. The tournament comprises 24 teams, with Georgia being the only team Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..

In [98]:
pd.set_option('display.max_colwidth',2000)
df3=pd.DataFrame({'Dog':['Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..vvvGet ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..','.UEFA Euro 2024 features a','.UEFA Euro 2024 features sssssss']})

In [99]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          Dog
0  Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..vvvGet ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  .UEFA Euro 2024 features a
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            .UEFA Euro 2024 features sssssss

In [100]:
df3['length']=df3['Dog'].apply(len)

In [101]:
df3

,Dog,length
0,"Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..vvvGet ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..",1130
1,.UEFA Euro 2024 features a,26
2,.UEFA Euro 2024 features sssssss,32

In [102]:
df3['word count']=df3['Dog'].apply(lambda x: len(x.split()))

In [103]:
df3

,Dog,length,word count
0,"Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..vvvGet ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..Get ready for thrilling matches, unforgettable moments, and the crowning of a new Euro champion.UEFA Euro 2024 features a line-up of powerhouse teams ready to ..",1130,176
1,.UEFA Euro 2024 features a,26,5
2,.UEFA Euro 2024 features sssssss,32,5

In [104]:
df

                                                                                                                                                         Desc
0  Germany hosts the tournament, which is taking place from 14 June 2024 to 14 July 2024. The tournament comprises 24 teams, with Georgia being the only team

In [106]:
df5=pd.DataFrame({'a':[1,2,3,4,5],'b':[4,5,6,7,8]})

In [107]:
df5

   a  b
0  1  4
1  2  5
2  3  6
3  4  7
4  5  8

In [108]:
df5['a'].mean()

3.0

In [109]:
df5['a'].mode()

0    1
1    2
2    3
3    4
4    5
Name: a, dtype: int64

In [112]:
df5['a'].std

<bound method NDFrame._add_numeric_operations.<locals>.std of 0    1
1    2
2    3
3    4
4    5
Name: a, dtype: int64>

In [113]:
df5['a'].sum()

15

In [114]:
df5['a'].min()

1

In [115]:
df5['a'].rolling(window=2).sum()

0    NaN
1    3.0
2    5.0
3    7.0
4    9.0
Name: a, dtype: float64

In [117]:
df5['a'].rolling(window=3).sum()

0     NaN
1     NaN
2     6.0
3     9.0
4    12.0
Name: a, dtype: float64

In [118]:
df5['a'].cumsum()

0     1
1     3
2     6
3    10
4    15
Name: a, dtype: int64

In [120]:
df6=pd.date_range(start='2024-5-3',end='2024-6-3')

In [121]:
df6

DatetimeIndex(['2024-05-03', '2024-05-04', '2024-05-05', '2024-05-06',
               '2024-05-07', '2024-05-08', '2024-05-09', '2024-05-10',
               '2024-05-11', '2024-05-12', '2024-05-13', '2024-05-14',
               '2024-05-15', '2024-05-16', '2024-05-17', '2024-05-18',
               '2024-05-19', '2024-05-20', '2024-05-21', '2024-05-22',
               '2024-05-23', '2024-05-24', '2024-05-25', '2024-05-26',
               '2024-05-27', '2024-05-28', '2024-05-29', '2024-05-30',
               '2024-05-31', '2024-06-01', '2024-06-02', '2024-06-03'],
              dtype='datetime64[ns]', freq='D')

In [122]:
df7=pd.date_range(start='2024-6-3',end='2024-7-3')

In [123]:
df7

DatetimeIndex(['2024-06-03', '2024-06-04', '2024-06-05', '2024-06-06',
               '2024-06-07', '2024-06-08', '2024-06-09', '2024-06-10',
               '2024-06-11', '2024-06-12', '2024-06-13', '2024-06-14',
               '2024-06-15', '2024-06-16', '2024-06-17', '2024-06-18',
               '2024-06-19', '2024-06-20', '2024-06-21', '2024-06-22',
               '2024-06-23', '2024-06-24', '2024-06-25', '2024-06-26',
               '2024-06-27', '2024-06-28', '2024-06-29', '2024-06-30',
               '2024-07-01', '2024-07-02', '2024-07-03'],
              dtype='datetime64[ns]', freq='D')

In [124]:
df8=pd.DataFrame({'Date':['1-1-2024','2-2-2024','3-3-2024']})

In [125]:
df8

       Date
0  1-1-2024
1  2-2-2024
2  3-3-2024

In [126]:
df8['updated date']=pd.to_datetime(df8['Date'])

In [127]:
df8

       Date updated date
0  1-1-2024   2024-01-01
1  2-2-2024   2024-02-02
2  3-3-2024   2024-03-03

In [128]:
df8.dtypes

Date                    object
updated date    datetime64[ns]
dtype: object

In [138]:
df8['year']=df8['updated date'].dt.year

In [139]:
df8

       Date updated date  year
0  1-1-2024   2024-01-01  2024
1  2-2-2024   2024-02-02  2024
2  3-3-2024   2024-03-03  2024

In [148]:
df8['month']=df8['updated date'].dt.month

In [146]:
df8

       Date updated date  year  month
0  1-1-2024   2024-01-01  2024      1
1  2-2-2024   2024-02-02  2024      2
2  3-3-2024   2024-03-03  2024      3

In [157]:
td=pd.Timedelta(hours=1,days=30,minutes=21)

In [154]:
cd=td+df8[['updated date']]

In [155]:
cd

         updated date
0 2024-01-31 01:21:00
1 2024-03-03 01:21:00
2 2024-04-02 01:21:00

In [156]:
df9

   a  b  c     name   surname
0  1  4  7    kabir    Gautam
1  2  5  8  pradeep  Bhandari
2  3  6  9   suresh    Sigdel

In [165]:
cat=pd.Categorical(df9)

In [164]:
cat

AttributeError: module 'pandas' has no attribute 'values_count'